name: "mkdmapnet"
layer {
  name: "train_image"
  type: "ImageData"
  top: "data"
  top: "data2"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "train_image_list.txt"
    batch_size: 10
  }
}
layer {
  name: "test_image"
  type: "ImageData"
  top: "data"
  top: "data2"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "test_image_list.txt"
    batch_size: 10
  }
}
layer {
  name: "train_depth"
  type: "ImageData"
  top: "label"
  top: "label2"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 1
  }
  image_data_param {
    source: "train_depth_list.txt"
    batch_size: 10
    is_color: false
  }
}
layer {
  name: "test_depth"
  type: "ImageData"
  top: "label"
  top: "label2"
  include {
    phase: TEST
  }
  transform_param {
    scale: 1
  }
  image_data_param {
    source: "test_depth_list.txt"
    batch_size: 10
    is_color: false
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    pad_h: 2
    pad_w: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nonlinear1"
  type: "ReLU"
  bottom: "conv1"
  top: "nonlinear1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "nonlinear1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 1
    kernel_size: 5
    stride: 1
    pad_h: 2
    pad_w: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "nonlinear2"
  type: "ReLU"
  bottom: "conv2"
  top: "nonlinear2"
}
layer {
  name: "accuracy"
  type: "EuclideanLoss"
  bottom: "nonlinear2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "nonlinear2"
  bottom: "label"
  top: "loss"
}
